[
    {
      "title": "Yellow Leaf Bay Beach Day",
      "shortDescription": "Relax on the white sands of Taniti’s most famous beach.",
      "longDescription": "Located just outside Taniti City, Yellow Leaf Bay offers gentle waves, warm sand, and stunning sunsets. Beach chair rentals, local snack shacks, and paddleboard rentals are available.",
      "image": "images/Beach.jpeg",
      "imageCredit": "Photo by Taniti Tourism Board",
      "imageTitle": "Tourists relaxing on Yellow Leaf Bay beach",
      "imageAltText": "White sand beach with turquoise water and beachgoers"
    },
    {
      "title": "Volcano Summit Hike",
      "shortDescription": "Take a guided hike to Taniti’s active volcano.",
      "longDescription": "Led by certified local guides, this hike to the volcanic rim offers breathtaking views and geological insights. Safety gear and refreshments are provided.",
      "image": "images/Beach.jpeg",
      "imageCredit": "Taniti Parks & Rec Department",
      "imageTitle": "Hikers approaching the rim of Taniti’s volcano",
      "imageAltText": "Group of hikers on a trail with the volcano in the background"
    },
    {
      "title": "Rainforest Canopy Walk",
      "shortDescription": "Walk among the treetops in Taniti’s lush rainforest.",
      "longDescription": "This elevated walkway offers unique perspectives on the flora and fauna of the tropical rainforest. Great for photography and bird watching.",
      "image": "images/Beach.jpeg",
      "imageCredit": "Photo by EcoTaniti Tours",
      "imageTitle": "Suspended walkway through rainforest canopy",
      "imageAltText": "Tourists walking on a canopy bridge above dense forest"
    },
    {
      "title": "Cultural Tour of Taniti City",
      "shortDescription": "Experience native architecture and island traditions.",
      "longDescription": "This walking tour showcases historic Tanitian buildings, traditional crafts, and local storytelling. Includes stops at artisan markets and historic sites.",
      "image": "images/Beach.jpeg",
      "imageCredit": "Taniti Historical Society",
      "imageTitle": "Guided tour through Taniti City’s cultural district",
      "imageAltText": "Tour group walking past native-style architecture and shops"
    },
    {
      "title": "Sunset Harbor Cruise",
      "shortDescription": "Sail through Taniti’s tranquil harbor at sunset.",
      "longDescription": "Enjoy island music, tropical drinks, and dolphin sightings on this relaxing evening cruise. Great for families and couples.",
      "image": "images/Beach.jpeg",
      "imageCredit": "Image courtesy of Taniti Cruises",
      "imageTitle": "Boat sailing into the sunset near Taniti harbor",
      "imageAltText": "Catamaran with people enjoying the sunset on open water"
    }
  ]
  