[
  {
    "title": "Taniti Grand Resort",
    "shortDescription": "A luxurious beachfront resort with world-class amenities. Wake up to the sound of the waves and enjoy exclusive access to Taniti's pristine shoreline. From infinity pools to fine dining, every detail is designed for comfort and indulgence.",
    "details": [
      "Enjoy ocean-view suites designed with modern elegance and local flair, offering the perfect blend of comfort and island charm. Each room is outfitted with premium linens, smart technology, and private balconies. It's the ultimate setting for rest and relaxation.",
      "Spend your afternoons lounging by the infinity pools or relaxing in private cabanas surrounded by swaying palms and ocean breezes. Attentive service ensures drinks and snacks are always within reach. The calming sound of waves provides the perfect backdrop.",
      "Dine at our award-winning restaurants featuring fresh seafood, international cuisine, and tropical cocktails. With both casual and fine dining options, there's something to suit every palate. Evening meals often include live music and beachfront ambiance.",
      "The resort is just steps from the shore and offers beachside service, water sports, and sunset views that take your breath away. Guests can kayak, paddleboard, or simply bask in the golden hour glow. Our staff is always on hand to help plan unforgettable activities.",
      "<h3>Contact</h3><ul><li>Address: 100 Coastal Way, Taniti Island</li><li>Phone: (555) 123-4567</li><li>Email: grandresort@taniti.example.com</li></ul>"
    ],
    "image": "images/Beach.jpeg",
    "imageCredit": "M Swiet Productions/Getty Images",
    "imageTitle": "Taniti Grand Resort by the beach",
    "imageAltText": "Elegant resort facing the ocean with palm trees",
    "heroTitle": "Experience Beachfront Luxury",
    "heroText": "Relax in ocean-view suites and savor world-class dining at Taniti’s most luxurious seaside resort."
  },
  {
    "title": "Mountainview Retreat",
    "shortDescription": "Nestled in the hills with panoramic views of Taniti’s natural beauty. This serene escape is ideal for those seeking rejuvenation through wellness, nature, and tranquility.",
    "details": [
      "Find peace among the treetops at this hillside retreat offering spa treatments and natural hot spring baths. Each therapy is rooted in local traditions and designed to restore balance and energy. The sounds of nature provide a calming soundtrack throughout your stay.",
      "Unwind with daily yoga classes held at sunrise and sunset, accompanied by mountain breezes and birdsong. Certified instructors guide all levels through gentle flows. Classes are held in an open-air pavilion surrounded by forest views.",
      "Enjoy gourmet plant-based meals prepared with locally sourced ingredients, perfect for wellness-focused travelers. Our chefs craft delicious and nourishing dishes that change with the seasons. Mealtimes are a celebration of health and flavor.",
      "Designed with eco-conscious materials and practices, the retreat blends seamlessly with the lush island landscape. Solar panels, rainwater harvesting, and green roofs reduce environmental impact. Sustainability is woven into every aspect of your visit.",
      "<h3>Contact</h3><ul><li>Address: 88 Harmony Trail, Highlands, Taniti</li><li>Phone: (555) 234-6789</li><li>Email: mountainretreat@taniti.example.com</li></ul>"
    ],
    "image": "images/Beach.jpeg",
    "imageCredit": "M Swiet Productions/Getty Images",
    "imageTitle": "Retreat in the hills of Taniti",
    "imageAltText": "Lush hillside resort with spa and scenic overlook",
    "heroTitle": "Rejuvenate in the Hills",
    "heroText": "Escape to a peaceful sanctuary where wellness meets wilderness in Taniti’s breathtaking mountain hideaway."
  },
  {
    "title": "Lagoon Bungalows",
    "shortDescription": "Sleep above the water in private overwater bungalows. With glass floor panels and uninterrupted lagoon views, each stay promises a magical island experience.",
    "details": [
      "Each bungalow features a private deck with direct access to the crystal-clear lagoon for swimming or snorkeling. Wake up to the sound of gentle waves beneath you. The experience is immersive, serene, and completely unforgettable.",
      "Watch fish swim beneath your feet through in-room glass floor panels, a signature feature of the Lagoon Bungalows. These panels let you feel connected to the ocean even while indoors. At night, underwater lights attract tropical fish for a glowing display.",
      "Perfect for romantic getaways, honeymoons, or anyone seeking tranquility on the water. The secluded setting ensures privacy and intimacy. It’s your personal oasis above the sea.",
      "Guests enjoy in-room breakfast delivery, sunset cocktails, and starlit evenings surrounded by gentle waves. Dining under the stars on your deck is an experience unlike any other. Our staff is dedicated to creating magical moments for every guest.",
      "<h3>Contact</h3><ul><li>Address: 7 Driftwood Lane, Taniti Lagoon</li><li>Phone: (555) 345-7890</li><li>Email: lagoonbungalows@taniti.example.com</li></ul>"
    ],
    "image": "images/Beach.jpeg",
    "imageCredit": "M Swiet Productions/Getty Images",
    "imageTitle": "Overwater bungalows at Taniti Lagoon",
    "imageAltText": "Thatched-roof bungalows on stilts over turquoise water",
    "heroTitle": "Sleep Above the Sea",
    "heroText": "Drift into paradise in Taniti’s iconic overwater bungalows, where serenity and scenery meet in perfect harmony."
  }
]
