[
  {
    "title": "The Coconut Grill",
    "shortDescription": "Enjoy laid-back beachfront dining with a local twist. The Coconut Grill offers a friendly, sand-between-your-toes atmosphere and island-style BBQ perfect for families or couples. Savor fresh grilled seafood and tropical drinks while you watch the waves roll in.",
    "details": [
      "The Coconut Grill is one of Taniti’s most iconic casual eateries, set directly on the beach with palm trees overhead and tiki torches at dusk. Guests dine just feet from the surf, making it the ideal location for sunset meals or beachside brunch.",
      "The menu features a mix of local seafood, pork skewers, and vegetarian options like grilled plantains and pineapple stir fry. Their famous coconut rice and papaya slaw are must-try side dishes.",
      "Live ukulele music starts each evening around 6 p.m., played by rotating local musicians who add a truly authentic Tanitian atmosphere. It's not uncommon for guests to join in the dancing or sing along.",
      "Casual and kid-friendly, this is a great spot to grab dinner in flip-flops after a long day in the sun. The atmosphere is welcoming, vibrant, and filled with the smells of smoked spices and tropical fruits.",
      "<h3>Contact</h3><ul><li>Address: 9 Volcano Peak Road, Taniti Summit</li><li>Phone: (555) 987-6543</li><li>Email: grill@tanititaste.com</li></ul>"
    ],
    "image": "images/Beach.jpeg",
    "imageCredit": "M Swiet Productions/Getty Images",
    "imageTitle": "Beachfront dining at The Coconut Grill",
    "imageAltText": "Outdoor tables on the beach with a grill and ocean in background",
    "heroTitle": "Island BBQ by the Shore",
    "heroText": "Kick off your flip-flops and grab a seat in the sand — Coconut Grill is where flavor meets the waves.",
    "externalLinkText":"Reserve A Table"
  },
  {
    "title": "Mango Grove",
    "shortDescription": "Surrounded by lush greenery and glowing string lights, Mango Grove brings the garden-to-table movement to Taniti. Enjoy creative dishes made with the freshest local ingredients, perfect for romantic evenings or mindful foodies.",
    "details": [
      "Tucked away in a quiet tropical garden, Mango Grove offers diners a tranquil space surrounded by native plants, flowering vines, and gentle ambient music. The open-air layout means every table has a view of the lush surroundings.",
      "The rotating menu changes weekly, with highlights like roasted breadfruit ravioli, citrus-marinated fish, and coconut-lime risotto. They prioritize local sourcing, meaning everything is freshly picked or caught that day.",
      "Soft lighting from hanging lanterns and fireflies sets the tone for romantic dinners or peaceful solo meals. Guests are encouraged to take their time, sip a herbal cocktail, and enjoy the moment.",
      "Mango Grove is especially popular with couples and health-conscious travelers. They also offer a curated wine list and herbal mocktails for non-drinkers.",
      "<h3>Contact</h3><ul><li>Address: 88 Orchid Path, Taniti Grove District</li><li>Phone: (555) 123-7890</li><li>Email: mangogrove@tanitidining.com</li></ul>"
    ],
    "image": "images/Beach.jpeg",
    "imageCredit": "M Swiet Productions/Getty Images",
    "imageTitle": "Mango Grove Restaurant garden patio",
    "imageAltText": "Outdoor garden restaurant with hanging lights",
    "heroTitle": "Garden Dining, Elevated",
    "heroText": "Dine beneath the stars and among the trees with fresh, locally inspired cuisine at Mango Grove.",
    "externalLinkText":"Reserve A Table"
  },
  {
    "title": "Tiki Tapas Bar",
    "shortDescription": "This lively bar is the place to share small plates and stories. Tiki Tapas blends island flavors with global inspiration, all served with colorful cocktails and unbeatable sunset views.",
    "details": [
      "Tiki Tapas Bar is perched above the bay, giving guests a sweeping view of the water and nearby islands. As the sun sets, the whole patio glows with a mix of natural light and festive tiki torches.",
      "The tapas menu is an ever-changing array of small plates, drawing influence from Caribbean, Pacific Rim, and Latin cuisines. Expect creative combinations like tuna poke tostadas, yucca fritters, and tamarind BBQ ribs.",
      "Signature cocktails — often served in coconuts or hollowed pineapples — include hibiscus mojitos and rum-infused cold brews. For non-drinkers, tropical mocktails with fresh fruit purees are just as refreshing.",
      "The bar often features DJs spinning tropical beats or live acoustic sets on weekends, making it a go-to evening hangout for locals and tourists alike. The atmosphere is lively but never overwhelming.",
      "<h3>Contact</h3><ul><li>Address: 22 Marina Bluff Lane, Taniti Waterfront</li><li>Phone: (555) 321-4567</li><li>Email: tiki@tanititapas.com</li></ul>"
    ],
    "image": "images/Beach.jpeg",
    "imageCredit": "M Swiet Productions/Getty Images",
    "imageTitle": "Tiki Tapas patio at sunset",
    "imageAltText": "Cocktail bar with tapas plates and tiki torches at dusk",
    "heroTitle": "Tapas at Twilight",
    "heroText": "From tropical bites to sunset sips, Tiki Tapas Bar is Taniti's go-to for good vibes and better views.",
    "externalLinkText":"Reserve A Table"
  },
  {
    "title": "Volcano Pizza",
    "shortDescription": "A bold take on a comfort food classic. Volcano Pizza delivers blazing flavor combinations with its signature wood-fired oven and tropical toppings like taro crust and pineapple-habanero sauce.",
    "details": [
      "Volcano Pizza sits just off the bustling town square, with indoor-outdoor seating and murals depicting Taniti’s volcanic history. The oven itself was built from volcanic stone sourced on the island.",
      "The crust is chewy and crisp with a hint of char from the blazing oven — which reaches nearly 800 degrees. Toppings push the envelope, with offerings like smoked banana peppers, coconut bacon, and even calamari rings.",
      "Vegetarian and gluten-free eaters are welcomed with taro and cauliflower crusts, plus dairy-free cheese and an array of fresh produce-based options. Families with picky kids can stick to simple margherita or pepperoni pies.",
      "The atmosphere is high-energy with upbeat music, team pizza-throwing behind the counter, and long communal tables where guests are encouraged to mingle. There’s also a take-out window for pizza on the go.",
      "<h3>Contact</h3><ul><li>Address: 101 Ember Alley, Taniti Town Square</li><li>Phone: (555) 777-9012</li><li>Email: pizza@volcanotaniti.com</li></ul>"
    ],
    "image": "images/Beach.jpeg",
    "imageCredit": "M Swiet Productions/Getty Images",
    "imageTitle": "Chef placing pizza in a wood-fired oven",
    "imageAltText": "Wood-fired pizza oven and tropical toppings",
    "heroTitle": "Where Flavor Erupts",
    "heroText": "At Volcano Pizza, bold flavors and blazing ovens create an island take on everyone’s favorite dish.",
    "externalLinkText":"Reserve A Table"
  }
]
